#ifndef BANK_H
#define BANK_H
#include "commercialorganisation.h"

class Bank : public CommercialOrg//наследование от базового класса иерархии в результате чего данный класс будет содержать в себе все поля (переменные) и
                                 //методы (функции) базового класса
{
private:
//--------------------------------------------------------------------------------------//
//    enum{
//        visa = 0, masterCard, payPal   //перечисление - условно, псевдоним для целого типа данных в данном случае на промежутке от 0 до 3
//        //каждая цифра отвечает соответствующей системе оплаты
//    };
//--------------------------------------------------------------------------------------//
    //int *cardPaySystems;//система оплаты через карту - массив целых чисел, которые будут в диапазоне указанном выше в перечислении. Таким образом каждое из
    //из этих чисел будет соответствовать оприделенной системе оплаты
    int cashYearlyFlow;//годовой оборот денег
public:
//--------------------------------------------------------------------------------------//
    Bank();
    Bank(std::string &name, unsigned int workersQuantity, unsigned int clientsQuantity, unsigned int branchesQuantity,
         /*const std::string *partnerships,*/ std::string &hqCountry, std::string &description, /*int *cardPaySystems,*/ int cashYearlyFlow);//конструктор с параметрами
    ~Bank();//деструктор
//--------------------------------------------------------------------------------------//
    //сетеры
    void setCashYearlyFlow(int cashYearlyFlow);
    //void setCardPaySystems(int *cardPatSystems);
//--------------------------------------------------------------------------------------//
    //геттеры
    int getCashYearlyFlow();
    //std::pair<int *, size_t> getCardPaySystems();
//--------------------------------------------------------------------------------------//
    void print() const override;
//--------------------------------------------------------------------------------------//
};

#endif // BANK_H
